# Проект по SQL

## Описание данных

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

**Задания**
- Посчитайте, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитайте количество обзоров и среднюю оценку;
- Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;
- Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
- Посчитайте среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

## Исследование таблиц

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import text, create_engine
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{user}:{pwd}@{host}:{port}/{db}'.format(**db_config)
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})
con=engine.connect()

In [3]:
def look_table(table):    
    display(pd.io.sql.read_sql('''SELECT * FROM {} LIMIT 5'''.format(table), con = engine))
    display(pd.io.sql.read_sql('''SELECT * FROM {}'''.format(table), con = engine).info())

In [4]:
look_table('books')

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   book_id           1000 non-null   int64
 1   author_id         1000 non-null   int64
 2   title             1000 non-null   object
 3   num_pages         1000 non-null   int64
 4   publication_date  1000 non-null   object
 5   publisher_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

None

In [5]:
look_table('authors')

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   author_id  636 non-null    int64
 1   author     636 non-null    object
dtypes: int64(1), object(1)
memory usage: 10.1+ KB

None

In [6]:
look_table('publishers')

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   publisher_id  340 non-null    int64
 1   publisher     340 non-null    object
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

None

In [7]:
look_table('ratings')

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6456 entries, 0 to 6455
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating_id  6456 non-null   int64
 1   book_id    6456 non-null   int64
 2   username   6456 non-null   object
 3   rating     6456 non-null   int64
dtypes: int64(3), object(1)
memory usage: 201.9+ KB

None

In [8]:
look_table('reviews')

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   review_id  2793 non-null   int64
 1   book_id    2793 non-null   int64
 2   username   2793 non-null   object
 3   text       2793 non-null   object
dtypes: int64(2), object(2)
memory usage: 87.4+ KB

None

Подключились к базе данных, вывели первые 5 строк таблиц и общую информацию о них.

## Задания

### Посчитайть, сколько книг вышло после 1 января 2000 года.

In [9]:
query = ''' 
        SELECT Count(book_id)
        FROM books
        WHERE publication_date >= Date('2000-01-01')
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

   count
0    821

После 1 января 2000 года вышло 819 книг.

### Для каждой книги посчитаем количество обзоров и среднюю оценку.

In [10]:
query = ''' 
        SELECT b.book_id,
               b.title,
               count(DISTINCT rv.review_id) AS cnt_reviews,
               round(AVG(r.rating), 2) AS avg_rating
        FROM books AS b
        LEFT JOIN reviews AS rv ON b.book_id = rv.book_id
        LEFT JOIN ratings AS r ON b.book_id = r.book_id 
        GROUP  BY b.book_id, b.title
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

,book_id,title,cnt_reviews,avg_rating
0,1,'Salem's Lot,2,3.67
1,2,1 000 Places to See Before You Die,1,2.50
2,3,13 Little Blue Envelopes (Little Blue Envelope...,3,4.67
3,4,1491: New Revelations of the Americas Before C...,2,4.50
4,5,1776,4,4.00
...,...,...,...,...
995,996,Wyrd Sisters (Discworld #6; Witches #2),3,3.67
996,997,Xenocide (Ender's Saga #3),3,3.40
997,998,Year of Wonders,4,3.20
998,999,You Suck (A Love Story #2),2,4.50
999,1000,Zen and the Art of Motorcycle Maintenance: An ...,4,3.83

In [11]:
query = ''' 
        SELECT SUM(cnt_reviews)
        FROM
        (SELECT b.book_id,
               b.title,
               count(DISTINCT rv.review_id) AS cnt_reviews,
               round(AVG(r.rating), 2) AS avg_rating
        FROM books AS b
        LEFT JOIN reviews AS rv ON b.book_id = rv.book_id
        LEFT JOIN ratings AS r ON b.book_id = r.book_id 
        GROUP  BY b.book_id, b.title) AS a
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

      sum
0  2793.0

In [12]:
query = ''' 
        SELECT count(review_id)
        FROM reviews
      
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

   count
0   2793

Вывели список книг с количеством обзоров и средней оценкой.

### Определить издательство, которое выпустило наибольшее число книг толще 50 страниц.

In [13]:
query = ''' 
        SELECT publisher,
               Count(book_id)
        FROM books AS b
        LEFT JOIN publishers AS p ON p.publisher_id = b.publisher_id
        WHERE num_pages > 50 GROUP  BY publisher
          ORDER  BY COUNT DESC
        LIMIT 1
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

       publisher  count
0  Penguin Books     42

Издательство Penguin Books выпустило наибольшее число книг толще 50 страниц - 42 штуки.

### Определить автора с самой высокой средней оценкой книг — учитывайть только книги с 50 и более оценками

In [14]:
query = '''             
        SELECT author,
               ROUND(AVG(avg_raiting), 2) AS avg_raiting,
               SUM(rating_count) AS rate_cnt
        FROM
          (SELECT author_id,
                  title,
                  AVG(rating) AS avg_raiting,
                  COUNT(rating) AS rating_count
           FROM books
           LEFT JOIN ratings ON books.book_id = ratings.book_id
           GROUP BY title,
                    author_id
           HAVING COUNT(rating_id) >= 50) AS r
        LEFT JOIN authors ON r.author_id = authors.author_id
        GROUP BY author
        ORDER BY avg_raiting DESC
        LIMIT 1             
        '''
pd.io.sql.read_sql(sql=text(query), con = con)

                       author  avg_raiting  rate_cnt
0  J.K. Rowling/Mary GrandPré         4.28     310.0

Автор с самой высокой средней оценкой книг - J.K. Rowling/Mary GrandPré.

### Посчитать среднее количество обзоров от пользователей, которые поставили больше 48 оценок.

In [15]:
query = '''
        SELECT AVG(reviews_cnt)
        FROM
          (SELECT username,
                  COUNT(review_id) AS reviews_cnt
           FROM reviews
           WHERE username IN
               (SELECT username
                FROM ratings
                GROUP BY username
                HAVING COUNT(rating_id) > 48)
           GROUP BY username) AS a
         ''' 
pd.io.sql.read_sql(sql=text(query), con = con)

    avg
0  24.0

Среднее количество обзоров от пользователей, которые поставили больше 48 оценок - 24

## Выводы:

1. После 1 января 2000 года вышло 819 книг.
2. Выведен список книг с количеством обзоров и средней оценкой.
3. Издательство Penguin Books выпустило наибольшее число книг толще 50 страниц - 42 штуки.
4. Автор с самой высокой средней оценкой книг - J.K. Rowling/Mary GrandPré.
5. Среднее количество обзоров от пользователей, которые поставили больше 48 оценок - 24